---
kind: method
id: M:Autodesk.Revit.DB.CurtainGridSet.GetEnumerator
source: html/ccd019c5-0d8f-7e5f-2305-bee99c92ad9d.htm
---
# Autodesk.Revit.DB.CurtainGridSet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.